app/controllers/meals_controller.rb

SELECT "meals".* FROM "meals" WHERE "meals"."day" = 3 LIMIT 1
---
  def index
    today = Date.today.day
    @meal = Meal.find_by(day: today) || Meal.new(day: today, breakfast: "Belirtilmemiş", lunch: "Belirtilmemiş", dinner: "Belirtilmemiş")